test/solver/incompressibleFluidNeoN/cases/turbulentBox/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar>
512
(
1.3517955736141513e+01
1.3280356865025585e+01
8.5362436991850892e+00
1.4216271858828927e+01
1.9664684490502729e+01
1.1064289957762426e+01
1.8135968123540646e+01
1.3918836499237646e+01
...
)
;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
