test/solver/incompressibleFluidNeoN/cases/turbulentBox/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar>
512
(
4.9874214307153250e+02
3.8220277360887115e+02
3.9675678463713848e+02
1.1627084666885347e+02
9.1577705300345727e+01
2.6903584696800704e+02
2.7963230884981408e+02
1.7287449566556717e+02
...
)
;

boundaryField
{
    ".*"
    {
        type            zeroGradient;
    }
}
